lpodkalicki/blog/avr/asm/include/ATxmega384C3def.inc
; PORT_INTCTRL masks
.equ PORT_INT1LVL_gm = 0x0C ; Port Interrupt 1 Level group mask
.equ PORT_INT1LVL_gp = 2 ; Port Interrupt 1 Level group position
.equ PORT_INT1LVL0_bm = (1<<2) ; Port Interrupt 1 Level bit 0 mask
.equ PORT_INT1LVL0_bp = 2 ; Port Interrupt 1 Level bit 0 position
.equ PORT_INT1LVL1_bm = (1<<3) ; Port Interrupt 1 Level bit 1 mask
.equ PORT_INT1LVL1_bp = 3 ; Port Interrupt 1 Level bit 1 position
.equ PORT_INT0LVL_gm = 0x03 ; Port Interrupt 0 Level group mask
.equ PORT_INT0LVL_gp = 0 ; Port Interrupt 0 Level group position
.equ PORT_INT0LVL0_bm = (1<<0) ; Port Interrupt 0 Level bit 0 mask
.equ PORT_INT0LVL0_bp = 0 ; Port Interrupt 0 Level bit 0 position
.equ PORT_INT0LVL1_bm = (1<<1) ; Port Interrupt 0 Level bit 1 mask
.equ PORT_INT0LVL1_bp = 1 ; Port Interrupt 0 Level bit 1 position

; PORT_INTFLAGS masks
.equ PORT_INT1IF_bm = 0x02 ; Port Interrupt 1 Flag bit mask
.equ PORT_INT1IF_bp = 1 ; Port Interrupt 1 Flag bit position
.equ PORT_INT0IF_bm = 0x01 ; Port Interrupt 0 Flag bit mask
.equ PORT_INT0IF_bp = 0 ; Port Interrupt 0 Flag bit position

; PORT_REMAP masks
.equ PORT_SPI_bm = 0x20 ; SPI bit mask
.equ PORT_SPI_bp = 5 ; SPI bit position
.equ PORT_USART0_bm = 0x10 ; USART0 bit mask
.equ PORT_USART0_bp = 4 ; USART0 bit position
.equ PORT_TC0D_bm = 0x08 ; Timer/Counter 0 Output Compare D bit mask
.equ PORT_TC0D_bp = 3 ; Timer/Counter 0 Output Compare D bit position
.equ PORT_TC0C_bm = 0x04 ; Timer/Counter 0 Output Compare C bit mask
.equ PORT_TC0C_bp = 2 ; Timer/Counter 0 Output Compare C bit position
.equ PORT_TC0B_bm = 0x02 ; Timer/Counter 0 Output Compare B bit mask
.equ PORT_TC0B_bp = 1 ; Timer/Counter 0 Output Compare B bit position
.equ PORT_TC0A_bm = 0x01 ; Timer/Counter 0 Output Compare A bit mask
.equ PORT_TC0A_bp = 0 ; Timer/Counter 0 Output Compare A bit position

; PORT_PIN0CTRL masks
.equ PORT_SRLEN_bm = 0x80 ; Slew Rate Enable bit mask
.equ PORT_SRLEN_bp = 7 ; Slew Rate Enable bit position
.equ PORT_INVEN_bm = 0x40 ; Inverted I/O Enable bit mask
.equ PORT_INVEN_bp = 6 ; Inverted I/O Enable bit position
.equ PORT_OPC_gm = 0x38 ; Output/Pull Configuration group mask
.equ PORT_OPC_gp = 3 ; Output/Pull Configuration group position
.equ PORT_OPC0_bm = (1<<3) ; Output/Pull Configuration bit 0 mask
.equ PORT_OPC0_bp = 3 ; Output/Pull Configuration bit 0 position
.equ PORT_OPC1_bm = (1<<4) ; Output/Pull Configuration bit 1 mask
.equ PORT_OPC1_bp = 4 ; Output/Pull Configuration bit 1 position
.equ PORT_OPC2_bm = (1<<5) ; Output/Pull Configuration bit 2 mask
.equ PORT_OPC2_bp = 5 ; Output/Pull Configuration bit 2 position
.equ PORT_ISC_gm = 0x07 ; Input/Sense Configuration group mask
.equ PORT_ISC_gp = 0 ; Input/Sense Configuration group position
.equ PORT_ISC0_bm = (1<<0) ; Input/Sense Configuration bit 0 mask
.equ PORT_ISC0_bp = 0 ; Input/Sense Configuration bit 0 position
.equ PORT_ISC1_bm = (1<<1) ; Input/Sense Configuration bit 1 mask
.equ PORT_ISC1_bp = 1 ; Input/Sense Configuration bit 1 position
.equ PORT_ISC2_bm = (1<<2) ; Input/Sense Configuration bit 2 mask
.equ PORT_ISC2_bp = 2 ; Input/Sense Configuration bit 2 position

; PORT_PIN1CTRL masks
; Masks for SRLEN aready defined
; Masks for INVEN aready defined
; Masks for OPC aready defined
; Masks for ISC aready defined

; PORT_PIN2CTRL masks
; Masks for SRLEN aready defined
; Masks for INVEN aready defined
; Masks for OPC aready defined
; Masks for ISC aready defined

; PORT_PIN3CTRL masks
; Masks for SRLEN aready defined
; Masks for INVEN aready defined
; Masks for OPC aready defined
; Masks for ISC aready defined

; PORT_PIN4CTRL masks
; Masks for SRLEN aready defined
; Masks for INVEN aready defined
; Masks for OPC aready defined
; Masks for ISC aready defined

; PORT_PIN5CTRL masks
; Masks for SRLEN aready defined
; Masks for INVEN aready defined
; Masks for OPC aready defined
; Masks for ISC aready defined

; PORT_PIN6CTRL masks
; Masks for SRLEN aready defined
; Masks for INVEN aready defined
; Masks for OPC aready defined
; Masks for ISC aready defined

; PORT_PIN7CTRL masks
; Masks for SRLEN aready defined
; Masks for INVEN aready defined
; Masks for OPC aready defined
; Masks for ISC aready defined
 
; Port Interrupt 0 Level
.equ PORT_INT0LVL_OFF_gc = (0x00<<0) ; Interrupt Disabled
.equ PORT_INT0LVL_LO_gc = (0x01<<0) ; Low Level
.equ PORT_INT0LVL_MED_gc = (0x02<<0) ; Medium Level
.equ PORT_INT0LVL_HI_gc = (0x03<<0) ; High Level

; Port Interrupt 1 Level
.equ PORT_INT1LVL_OFF_gc = (0x00<<2) ; Interrupt Disabled
.equ PORT_INT1LVL_LO_gc = (0x01<<2) ; Low Level
.equ PORT_INT1LVL_MED_gc = (0x02<<2) ; Medium Level
.equ PORT_INT1LVL_HI_gc = (0x03<<2) ; High Level

; Output/Pull Configuration
.equ PORT_OPC_TOTEM_gc = (0x00<<3) ; Totempole
.equ PORT_OPC_BUSKEEPER_gc = (0x01<<3) ; Totempole w/ Bus keeper on Input and Output
.equ PORT_OPC_PULLDOWN_gc = (0x02<<3) ; Totempole w/ Pull-down on Input
.equ PORT_OPC_PULLUP_gc = (0x03<<3) ; Totempole w/ Pull-up on Input
.equ PORT_OPC_WIREDOR_gc = (0x04<<3) ; Wired OR
.equ PORT_OPC_WIREDAND_gc = (0x05<<3) ; Wired AND
.equ PORT_OPC_WIREDORPULL_gc = (0x06<<3) ; Wired OR w/ Pull-down
.equ PORT_OPC_WIREDANDPULL_gc = (0x07<<3) ; Wired AND w/ Pull-up

; Input/Sense Configuration
.equ PORT_ISC_BOTHEDGES_gc = (0x00<<0) ; Sense Both Edges
.equ PORT_ISC_RISING_gc = (0x01<<0) ; Sense Rising Edge
.equ PORT_ISC_FALLING_gc = (0x02<<0) ; Sense Falling Edge
.equ PORT_ISC_LEVEL_gc = (0x03<<0) ; Sense Level (Transparent For Events)
.equ PORT_ISC_INPUT_DISABLE_gc = (0x07<<0) ; Disable Digital Input Buffer


;***************************************************************************
;** TC - 16-bit Timer/Counter With PWM
;***************************************************************************/

; TC0_CTRLA masks
.equ TC0_CLKSEL_gm = 0x0F ; Clock Selection group mask
.equ TC0_CLKSEL_gp = 0 ; Clock Selection group position
.equ TC0_CLKSEL0_bm = (1<<0) ; Clock Selection bit 0 mask
.equ TC0_CLKSEL0_bp = 0 ; Clock Selection bit 0 position
.equ TC0_CLKSEL1_bm = (1<<1) ; Clock Selection bit 1 mask
.equ TC0_CLKSEL1_bp = 1 ; Clock Selection bit 1 position
.equ TC0_CLKSEL2_bm = (1<<2) ; Clock Selection bit 2 mask
.equ TC0_CLKSEL2_bp = 2 ; Clock Selection bit 2 position
.equ TC0_CLKSEL3_bm = (1<<3) ; Clock Selection bit 3 mask
.equ TC0_CLKSEL3_bp = 3 ; Clock Selection bit 3 position

; TC0_CTRLB masks
.equ TC0_CCDEN_bm = 0x80 ; Compare or Capture D Enable bit mask
.equ TC0_CCDEN_bp = 7 ; Compare or Capture D Enable bit position
.equ TC0_CCCEN_bm = 0x40 ; Compare or Capture C Enable bit mask
.equ TC0_CCCEN_bp = 6 ; Compare or Capture C Enable bit position
.equ TC0_CCBEN_bm = 0x20 ; Compare or Capture B Enable bit mask
.equ TC0_CCBEN_bp = 5 ; Compare or Capture B Enable bit position
.equ TC0_CCAEN_bm = 0x10 ; Compare or Capture A Enable bit mask
.equ TC0_CCAEN_bp = 4 ; Compare or Capture A Enable bit position
.equ TC0_WGMODE_gm = 0x07 ; Waveform generation mode group mask
.equ TC0_WGMODE_gp = 0 ; Waveform generation mode group position
.equ TC0_WGMODE0_bm = (1<<0) ; Waveform generation mode bit 0 mask
.equ TC0_WGMODE0_bp = 0 ; Waveform generation mode bit 0 position
.equ TC0_WGMODE1_bm = (1<<1) ; Waveform generation mode bit 1 mask
.equ TC0_WGMODE1_bp = 1 ; Waveform generation mode bit 1 position
.equ TC0_WGMODE2_bm = (1<<2) ; Waveform generation mode bit 2 mask
.equ TC0_WGMODE2_bp = 2 ; Waveform generation mode bit 2 position

; TC0_CTRLC masks
.equ TC0_CMPD_bm = 0x08 ; Compare D Output Value bit mask
.equ TC0_CMPD_bp = 3 ; Compare D Output Value bit position
.equ TC0_CMPC_bm = 0x04 ; Compare C Output Value bit mask
.equ TC0_CMPC_bp = 2 ; Compare C Output Value bit position
.equ TC0_CMPB_bm = 0x02 ; Compare B Output Value bit mask
.equ TC0_CMPB_bp = 1 ; Compare B Output Value bit position
.equ TC0_CMPA_bm = 0x01 ; Compare A Output Value bit mask
.equ TC0_CMPA_bp = 0 ; Compare A Output Value bit position

; TC0_CTRLD masks
.equ TC0_EVACT_gm = 0xE0 ; Event Action group mask
.equ TC0_EVACT_gp = 5 ; Event Action group position
.equ TC0_EVACT0_bm = (1<<5) ; Event Action bit 0 mask
.equ TC0_EVACT0_bp = 5 ; Event Action bit 0 position
.equ TC0_EVACT1_bm = (1<<6) ; Event Action bit 1 mask
.equ TC0_EVACT1_bp = 6 ; Event Action bit 1 position
.equ TC0_EVACT2_bm = (1<<7) ; Event Action bit 2 mask
.equ TC0_EVACT2_bp = 7 ; Event Action bit 2 position
.equ TC0_EVDLY_bm = 0x10 ; Event Delay bit mask
.equ TC0_EVDLY_bp = 4 ; Event Delay bit position
.equ TC0_EVSEL_gm = 0x0F ; Event Source Select group mask
.equ TC0_EVSEL_gp = 0 ; Event Source Select group position
.equ TC0_EVSEL0_bm = (1<<0) ; Event Source Select bit 0 mask
.equ TC0_EVSEL0_bp = 0 ; Event Source Select bit 0 position
.equ TC0_EVSEL1_bm = (1<<1) ; Event Source Select bit 1 mask
.equ TC0_EVSEL1_bp = 1 ; Event Source Select bit 1 position
.equ TC0_EVSEL2_bm = (1<<2) ; Event Source Select bit 2 mask
.equ TC0_EVSEL2_bp = 2 ; Event Source Select bit 2 position
.equ TC0_EVSEL3_bm = (1<<3) ; Event Source Select bit 3 mask
.equ TC0_EVSEL3_bp = 3 ; Event Source Select bit 3 position

; TC0_CTRLE masks
.equ TC0_BYTEM_gm = 0x03 ; Byte Mode group mask
.equ TC0_BYTEM_gp = 0 ; Byte Mode group position
.equ TC0_BYTEM0_bm = (1<<0) ; Byte Mode bit 0 mask
.equ TC0_BYTEM0_bp = 0 ; Byte Mode bit 0 position
.equ TC0_BYTEM1_bm = (1<<1) ; Byte Mode bit 1 mask
.equ TC0_BYTEM1_bp = 1 ; Byte Mode bit 1 position

