lpodkalicki/blog/avr/asm/include/ATxmega384C3def.inc
; TC0_INTCTRLA masks
.equ TC0_ERRINTLVL_gm = 0x0C ; Error Interrupt Level group mask
.equ TC0_ERRINTLVL_gp = 2 ; Error Interrupt Level group position
.equ TC0_ERRINTLVL0_bm = (1<<2) ; Error Interrupt Level bit 0 mask
.equ TC0_ERRINTLVL0_bp = 2 ; Error Interrupt Level bit 0 position
.equ TC0_ERRINTLVL1_bm = (1<<3) ; Error Interrupt Level bit 1 mask
.equ TC0_ERRINTLVL1_bp = 3 ; Error Interrupt Level bit 1 position
.equ TC0_OVFINTLVL_gm = 0x03 ; Overflow interrupt level group mask
.equ TC0_OVFINTLVL_gp = 0 ; Overflow interrupt level group position
.equ TC0_OVFINTLVL0_bm = (1<<0) ; Overflow interrupt level bit 0 mask
.equ TC0_OVFINTLVL0_bp = 0 ; Overflow interrupt level bit 0 position
.equ TC0_OVFINTLVL1_bm = (1<<1) ; Overflow interrupt level bit 1 mask
.equ TC0_OVFINTLVL1_bp = 1 ; Overflow interrupt level bit 1 position

; TC0_INTCTRLB masks
.equ TC0_CCDINTLVL_gm = 0xC0 ; Compare or Capture D Interrupt Level group mask
.equ TC0_CCDINTLVL_gp = 6 ; Compare or Capture D Interrupt Level group position
.equ TC0_CCDINTLVL0_bm = (1<<6) ; Compare or Capture D Interrupt Level bit 0 mask
.equ TC0_CCDINTLVL0_bp = 6 ; Compare or Capture D Interrupt Level bit 0 position
.equ TC0_CCDINTLVL1_bm = (1<<7) ; Compare or Capture D Interrupt Level bit 1 mask
.equ TC0_CCDINTLVL1_bp = 7 ; Compare or Capture D Interrupt Level bit 1 position
.equ TC0_CCCINTLVL_gm = 0x30 ; Compare or Capture C Interrupt Level group mask
.equ TC0_CCCINTLVL_gp = 4 ; Compare or Capture C Interrupt Level group position
.equ TC0_CCCINTLVL0_bm = (1<<4) ; Compare or Capture C Interrupt Level bit 0 mask
.equ TC0_CCCINTLVL0_bp = 4 ; Compare or Capture C Interrupt Level bit 0 position
.equ TC0_CCCINTLVL1_bm = (1<<5) ; Compare or Capture C Interrupt Level bit 1 mask
.equ TC0_CCCINTLVL1_bp = 5 ; Compare or Capture C Interrupt Level bit 1 position
.equ TC0_CCBINTLVL_gm = 0x0C ; Compare or Capture B Interrupt Level group mask
.equ TC0_CCBINTLVL_gp = 2 ; Compare or Capture B Interrupt Level group position
.equ TC0_CCBINTLVL0_bm = (1<<2) ; Compare or Capture B Interrupt Level bit 0 mask
.equ TC0_CCBINTLVL0_bp = 2 ; Compare or Capture B Interrupt Level bit 0 position
.equ TC0_CCBINTLVL1_bm = (1<<3) ; Compare or Capture B Interrupt Level bit 1 mask
.equ TC0_CCBINTLVL1_bp = 3 ; Compare or Capture B Interrupt Level bit 1 position
.equ TC0_CCAINTLVL_gm = 0x03 ; Compare or Capture A Interrupt Level group mask
.equ TC0_CCAINTLVL_gp = 0 ; Compare or Capture A Interrupt Level group position
.equ TC0_CCAINTLVL0_bm = (1<<0) ; Compare or Capture A Interrupt Level bit 0 mask
.equ TC0_CCAINTLVL0_bp = 0 ; Compare or Capture A Interrupt Level bit 0 position
.equ TC0_CCAINTLVL1_bm = (1<<1) ; Compare or Capture A Interrupt Level bit 1 mask
.equ TC0_CCAINTLVL1_bp = 1 ; Compare or Capture A Interrupt Level bit 1 position

; TC0_CTRLFCLR masks
.equ TC0_CMD_gm = 0x0C ; Command group mask
.equ TC0_CMD_gp = 2 ; Command group position
.equ TC0_CMD0_bm = (1<<2) ; Command bit 0 mask
.equ TC0_CMD0_bp = 2 ; Command bit 0 position
.equ TC0_CMD1_bm = (1<<3) ; Command bit 1 mask
.equ TC0_CMD1_bp = 3 ; Command bit 1 position
.equ TC0_LUPD_bm = 0x02 ; Lock Update bit mask
.equ TC0_LUPD_bp = 1 ; Lock Update bit position
.equ TC0_DIR_bm = 0x01 ; Direction bit mask
.equ TC0_DIR_bp = 0 ; Direction bit position

; TC0_CTRLFSET masks
; Masks for CMD aready defined
; Masks for LUPD aready defined
; Masks for DIR aready defined

; TC0_CTRLGCLR masks
.equ TC0_CCDBV_bm = 0x10 ; Compare or Capture D Buffer Valid bit mask
.equ TC0_CCDBV_bp = 4 ; Compare or Capture D Buffer Valid bit position
.equ TC0_CCCBV_bm = 0x08 ; Compare or Capture C Buffer Valid bit mask
.equ TC0_CCCBV_bp = 3 ; Compare or Capture C Buffer Valid bit position
.equ TC0_CCBBV_bm = 0x04 ; Compare or Capture B Buffer Valid bit mask
.equ TC0_CCBBV_bp = 2 ; Compare or Capture B Buffer Valid bit position
.equ TC0_CCABV_bm = 0x02 ; Compare or Capture A Buffer Valid bit mask
.equ TC0_CCABV_bp = 1 ; Compare or Capture A Buffer Valid bit position
.equ TC0_PERBV_bm = 0x01 ; Period Buffer Valid bit mask
.equ TC0_PERBV_bp = 0 ; Period Buffer Valid bit position

; TC0_CTRLGSET masks
; Masks for CCDBV aready defined
; Masks for CCCBV aready defined
; Masks for CCBBV aready defined
; Masks for CCABV aready defined
; Masks for PERBV aready defined

; TC0_INTFLAGS masks
.equ TC0_CCDIF_bm = 0x80 ; Compare or Capture D Interrupt Flag bit mask
.equ TC0_CCDIF_bp = 7 ; Compare or Capture D Interrupt Flag bit position
.equ TC0_CCCIF_bm = 0x40 ; Compare or Capture C Interrupt Flag bit mask
.equ TC0_CCCIF_bp = 6 ; Compare or Capture C Interrupt Flag bit position
.equ TC0_CCBIF_bm = 0x20 ; Compare or Capture B Interrupt Flag bit mask
.equ TC0_CCBIF_bp = 5 ; Compare or Capture B Interrupt Flag bit position
.equ TC0_CCAIF_bm = 0x10 ; Compare or Capture A Interrupt Flag bit mask
.equ TC0_CCAIF_bp = 4 ; Compare or Capture A Interrupt Flag bit position
.equ TC0_ERRIF_bm = 0x02 ; Error Interrupt Flag bit mask
.equ TC0_ERRIF_bp = 1 ; Error Interrupt Flag bit position
.equ TC0_OVFIF_bm = 0x01 ; Overflow Interrupt Flag bit mask
.equ TC0_OVFIF_bp = 0 ; Overflow Interrupt Flag bit position

; TC0_SPLIT_CTRLA masks
.equ TC0_SPLIT_CLKSEL_gm = 0x0F ; Clock Selection group mask
.equ TC0_SPLIT_CLKSEL_gp = 0 ; Clock Selection group position
.equ TC0_SPLIT_CLKSEL0_bm = (1<<0) ; Clock Selection bit 0 mask
.equ TC0_SPLIT_CLKSEL0_bp = 0 ; Clock Selection bit 0 position
.equ TC0_SPLIT_CLKSEL1_bm = (1<<1) ; Clock Selection bit 1 mask
.equ TC0_SPLIT_CLKSEL1_bp = 1 ; Clock Selection bit 1 position
.equ TC0_SPLIT_CLKSEL2_bm = (1<<2) ; Clock Selection bit 2 mask
.equ TC0_SPLIT_CLKSEL2_bp = 2 ; Clock Selection bit 2 position
.equ TC0_SPLIT_CLKSEL3_bm = (1<<3) ; Clock Selection bit 3 mask
.equ TC0_SPLIT_CLKSEL3_bp = 3 ; Clock Selection bit 3 position

; TC0_SPLIT_CTRLB masks
.equ TC0_SPLIT_HCMPDEN_bm = 0x80 ; High Byte Compare D Enable bit mask
.equ TC0_SPLIT_HCMPDEN_bp = 7 ; High Byte Compare D Enable bit position
.equ TC0_SPLIT_HCMPCEN_bm = 0x40 ; High Byte Compare C Enable bit mask
.equ TC0_SPLIT_HCMPCEN_bp = 6 ; High Byte Compare C Enable bit position
.equ TC0_SPLIT_HCMPBEN_bm = 0x20 ; High Byte Compare B Enable bit mask
.equ TC0_SPLIT_HCMPBEN_bp = 5 ; High Byte Compare B Enable bit position
.equ TC0_SPLIT_HCMPAEN_bm = 0x10 ; High Byte Compare A Enable bit mask
.equ TC0_SPLIT_HCMPAEN_bp = 4 ; High Byte Compare A Enable bit position
.equ TC0_SPLIT_LCMPDEN_bm = 0x08 ; Low Byte Compare D Enable bit mask
.equ TC0_SPLIT_LCMPDEN_bp = 3 ; Low Byte Compare D Enable bit position
.equ TC0_SPLIT_LCMPCEN_bm = 0x04 ; Low Byte Compare C Enable bit mask
.equ TC0_SPLIT_LCMPCEN_bp = 2 ; Low Byte Compare C Enable bit position
.equ TC0_SPLIT_LCMPBEN_bm = 0x02 ; Low Byte Compare B Enable bit mask
.equ TC0_SPLIT_LCMPBEN_bp = 1 ; Low Byte Compare B Enable bit position
.equ TC0_SPLIT_LCMPAEN_bm = 0x01 ; Low Byte Compare A Enable bit mask
.equ TC0_SPLIT_LCMPAEN_bp = 0 ; Low Byte Compare A Enable bit position

; TC0_SPLIT_CTRLC masks
.equ TC0_SPLIT_HCMPD_bm = 0x80 ; High Byte Compare D Output Value bit mask
.equ TC0_SPLIT_HCMPD_bp = 7 ; High Byte Compare D Output Value bit position
.equ TC0_SPLIT_HCMPC_bm = 0x40 ; High Byte Compare C Output Value bit mask
.equ TC0_SPLIT_HCMPC_bp = 6 ; High Byte Compare C Output Value bit position
.equ TC0_SPLIT_HCMPB_bm = 0x20 ; High Byte Compare B Output Value bit mask
.equ TC0_SPLIT_HCMPB_bp = 5 ; High Byte Compare B Output Value bit position
.equ TC0_SPLIT_HCMPA_bm = 0x10 ; High Byte Compare A Output Value bit mask
.equ TC0_SPLIT_HCMPA_bp = 4 ; High Byte Compare A Output Value bit position
.equ TC0_SPLIT_LCMPD_bm = 0x08 ; Low Byte Compare D Output Value bit mask
.equ TC0_SPLIT_LCMPD_bp = 3 ; Low Byte Compare D Output Value bit position
.equ TC0_SPLIT_LCMPC_bm = 0x04 ; Low Byte Compare C Output Value bit mask
.equ TC0_SPLIT_LCMPC_bp = 2 ; Low Byte Compare C Output Value bit position
.equ TC0_SPLIT_LCMPB_bm = 0x02 ; Low Byte Compare B Output Value bit mask
.equ TC0_SPLIT_LCMPB_bp = 1 ; Low Byte Compare B Output Value bit position
.equ TC0_SPLIT_LCMPA_bm = 0x01 ; Low Byte Compare A Output Value bit mask
.equ TC0_SPLIT_LCMPA_bp = 0 ; Low Byte Compare A Output Value bit position

