lpodkalicki/blog/avr/asm/include/ATxmega384C3def.inc
; TC0_SPLIT_CTRLE masks
.equ TC0_SPLIT_BYTEM_gm = 0x03 ; Byte Mode group mask
.equ TC0_SPLIT_BYTEM_gp = 0 ; Byte Mode group position
.equ TC0_SPLIT_BYTEM0_bm = (1<<0) ; Byte Mode bit 0 mask
.equ TC0_SPLIT_BYTEM0_bp = 0 ; Byte Mode bit 0 position
.equ TC0_SPLIT_BYTEM1_bm = (1<<1) ; Byte Mode bit 1 mask
.equ TC0_SPLIT_BYTEM1_bp = 1 ; Byte Mode bit 1 position

; TC0_SPLIT_INTCTRLA masks
.equ TC0_SPLIT_HUNFINTLVL_gm = 0x0C ; High Byte Underflow Interrupt Level group mask
.equ TC0_SPLIT_HUNFINTLVL_gp = 2 ; High Byte Underflow Interrupt Level group position
.equ TC0_SPLIT_HUNFINTLVL0_bm = (1<<2) ; High Byte Underflow Interrupt Level bit 0 mask
.equ TC0_SPLIT_HUNFINTLVL0_bp = 2 ; High Byte Underflow Interrupt Level bit 0 position
.equ TC0_SPLIT_HUNFINTLVL1_bm = (1<<3) ; High Byte Underflow Interrupt Level bit 1 mask
.equ TC0_SPLIT_HUNFINTLVL1_bp = 3 ; High Byte Underflow Interrupt Level bit 1 position
.equ TC0_SPLIT_LUNFINTLVL_gm = 0x03 ; Low Byte Underflow interrupt level group mask
.equ TC0_SPLIT_LUNFINTLVL_gp = 0 ; Low Byte Underflow interrupt level group position
.equ TC0_SPLIT_LUNFINTLVL0_bm = (1<<0) ; Low Byte Underflow interrupt level bit 0 mask
.equ TC0_SPLIT_LUNFINTLVL0_bp = 0 ; Low Byte Underflow interrupt level bit 0 position
.equ TC0_SPLIT_LUNFINTLVL1_bm = (1<<1) ; Low Byte Underflow interrupt level bit 1 mask
.equ TC0_SPLIT_LUNFINTLVL1_bp = 1 ; Low Byte Underflow interrupt level bit 1 position

; TC0_SPLIT_INTCTRLB masks
.equ TC0_SPLIT_LCMPDINTLVL_gm = 0xC0 ; Low Byte Compare D Interrupt Level group mask
.equ TC0_SPLIT_LCMPDINTLVL_gp = 6 ; Low Byte Compare D Interrupt Level group position
.equ TC0_SPLIT_LCMPDINTLVL0_bm = (1<<6) ; Low Byte Compare D Interrupt Level bit 0 mask
.equ TC0_SPLIT_LCMPDINTLVL0_bp = 6 ; Low Byte Compare D Interrupt Level bit 0 position
.equ TC0_SPLIT_LCMPDINTLVL1_bm = (1<<7) ; Low Byte Compare D Interrupt Level bit 1 mask
.equ TC0_SPLIT_LCMPDINTLVL1_bp = 7 ; Low Byte Compare D Interrupt Level bit 1 position
.equ TC0_SPLIT_LCMPCINTLVL_gm = 0x30 ; Low Byte Compare C Interrupt Level group mask
.equ TC0_SPLIT_LCMPCINTLVL_gp = 4 ; Low Byte Compare C Interrupt Level group position
.equ TC0_SPLIT_LCMPCINTLVL0_bm = (1<<4) ; Low Byte Compare C Interrupt Level bit 0 mask
.equ TC0_SPLIT_LCMPCINTLVL0_bp = 4 ; Low Byte Compare C Interrupt Level bit 0 position
.equ TC0_SPLIT_LCMPCINTLVL1_bm = (1<<5) ; Low Byte Compare C Interrupt Level bit 1 mask
.equ TC0_SPLIT_LCMPCINTLVL1_bp = 5 ; Low Byte Compare C Interrupt Level bit 1 position
.equ TC0_SPLIT_LCMPBINTLVL_gm = 0x0C ; Low Byte Compare B Interrupt Level group mask
.equ TC0_SPLIT_LCMPBINTLVL_gp = 2 ; Low Byte Compare B Interrupt Level group position
.equ TC0_SPLIT_LCMPBINTLVL0_bm = (1<<2) ; Low Byte Compare B Interrupt Level bit 0 mask
.equ TC0_SPLIT_LCMPBINTLVL0_bp = 2 ; Low Byte Compare B Interrupt Level bit 0 position
.equ TC0_SPLIT_LCMPBINTLVL1_bm = (1<<3) ; Low Byte Compare B Interrupt Level bit 1 mask
.equ TC0_SPLIT_LCMPBINTLVL1_bp = 3 ; Low Byte Compare B Interrupt Level bit 1 position
.equ TC0_SPLIT_LCMPAINTLVL_gm = 0x03 ; Low Byte Compare A Interrupt Level group mask
.equ TC0_SPLIT_LCMPAINTLVL_gp = 0 ; Low Byte Compare A Interrupt Level group position
.equ TC0_SPLIT_LCMPAINTLVL0_bm = (1<<0) ; Low Byte Compare A Interrupt Level bit 0 mask
.equ TC0_SPLIT_LCMPAINTLVL0_bp = 0 ; Low Byte Compare A Interrupt Level bit 0 position
.equ TC0_SPLIT_LCMPAINTLVL1_bm = (1<<1) ; Low Byte Compare A Interrupt Level bit 1 mask
.equ TC0_SPLIT_LCMPAINTLVL1_bp = 1 ; Low Byte Compare A Interrupt Level bit 1 position

; TC0_SPLIT_CTRLF masks
.equ TC0_SPLIT_CMD_gm = 0x0C ; Command group mask
.equ TC0_SPLIT_CMD_gp = 2 ; Command group position
.equ TC0_SPLIT_CMD0_bm = (1<<2) ; Command bit 0 mask
.equ TC0_SPLIT_CMD0_bp = 2 ; Command bit 0 position
.equ TC0_SPLIT_CMD1_bm = (1<<3) ; Command bit 1 mask
.equ TC0_SPLIT_CMD1_bp = 3 ; Command bit 1 position
.equ TC0_SPLIT_CMDEN_gm = 0x03 ; Command Enable group mask
.equ TC0_SPLIT_CMDEN_gp = 0 ; Command Enable group position
.equ TC0_SPLIT_CMDEN0_bm = (1<<0) ; Command Enable bit 0 mask
.equ TC0_SPLIT_CMDEN0_bp = 0 ; Command Enable bit 0 position
.equ TC0_SPLIT_CMDEN1_bm = (1<<1) ; Command Enable bit 1 mask
.equ TC0_SPLIT_CMDEN1_bp = 1 ; Command Enable bit 1 position

; TC0_SPLIT_INTFLAGS masks
.equ TC0_SPLIT_LCMPDIF_bm = 0x80 ; Low Byte Compare D Interrupt Flag bit mask
.equ TC0_SPLIT_LCMPDIF_bp = 7 ; Low Byte Compare D Interrupt Flag bit position
.equ TC0_SPLIT_LCMPCIF_bm = 0x40 ; Low Byte Compare C Interrupt Flag bit mask
.equ TC0_SPLIT_LCMPCIF_bp = 6 ; Low Byte Compare C Interrupt Flag bit position
.equ TC0_SPLIT_LCMPBIF_bm = 0x20 ; Low Byte Compare B Interrupt Flag bit mask
.equ TC0_SPLIT_LCMPBIF_bp = 5 ; Low Byte Compare B Interrupt Flag bit position
.equ TC0_SPLIT_LCMPAIF_bm = 0x10 ; Low Byte Compare A Interrupt Flag bit mask
.equ TC0_SPLIT_LCMPAIF_bp = 4 ; Low Byte Compare A Interrupt Flag bit position
.equ TC0_SPLIT_HUNFIF_bm = 0x02 ; High Byte Underflow Interrupt Flag bit mask
.equ TC0_SPLIT_HUNFIF_bp = 1 ; High Byte Underflow Interrupt Flag bit position
.equ TC0_SPLIT_LUNFIF_bm = 0x01 ; Low Byte Underflow Interrupt Flag bit mask
.equ TC0_SPLIT_LUNFIF_bp = 0 ; Low Byte Underflow Interrupt Flag bit position

; TC1_CTRLA masks
.equ TC1_CLKSEL_gm = 0x0F ; Clock Selection group mask
.equ TC1_CLKSEL_gp = 0 ; Clock Selection group position
.equ TC1_CLKSEL0_bm = (1<<0) ; Clock Selection bit 0 mask
.equ TC1_CLKSEL0_bp = 0 ; Clock Selection bit 0 position
.equ TC1_CLKSEL1_bm = (1<<1) ; Clock Selection bit 1 mask
.equ TC1_CLKSEL1_bp = 1 ; Clock Selection bit 1 position
.equ TC1_CLKSEL2_bm = (1<<2) ; Clock Selection bit 2 mask
.equ TC1_CLKSEL2_bp = 2 ; Clock Selection bit 2 position
.equ TC1_CLKSEL3_bm = (1<<3) ; Clock Selection bit 3 mask
.equ TC1_CLKSEL3_bp = 3 ; Clock Selection bit 3 position

; TC1_CTRLB masks
.equ TC1_CCBEN_bm = 0x20 ; Compare or Capture B Enable bit mask
.equ TC1_CCBEN_bp = 5 ; Compare or Capture B Enable bit position
.equ TC1_CCAEN_bm = 0x10 ; Compare or Capture A Enable bit mask
.equ TC1_CCAEN_bp = 4 ; Compare or Capture A Enable bit position
.equ TC1_WGMODE_gm = 0x07 ; Waveform generation mode group mask
.equ TC1_WGMODE_gp = 0 ; Waveform generation mode group position
.equ TC1_WGMODE0_bm = (1<<0) ; Waveform generation mode bit 0 mask
.equ TC1_WGMODE0_bp = 0 ; Waveform generation mode bit 0 position
.equ TC1_WGMODE1_bm = (1<<1) ; Waveform generation mode bit 1 mask
.equ TC1_WGMODE1_bp = 1 ; Waveform generation mode bit 1 position
.equ TC1_WGMODE2_bm = (1<<2) ; Waveform generation mode bit 2 mask
.equ TC1_WGMODE2_bp = 2 ; Waveform generation mode bit 2 position

