lpodkalicki/blog/avr/asm/include/ATxmega384C3def.inc
; Event Action
.equ TC_EVACT_OFF_gc = (0x00<<5) ; No Event Action
.equ TC_EVACT_CAPT_gc = (0x01<<5) ; Input Capture
.equ TC_EVACT_UPDOWN_gc = (0x02<<5) ; Externally Controlled Up/Down Count
.equ TC_EVACT_QDEC_gc = (0x03<<5) ; Quadrature Decode
.equ TC_EVACT_RESTART_gc = (0x04<<5) ; Restart
.equ TC_EVACT_FRQ_gc = (0x05<<5) ; Frequency Capture
.equ TC_EVACT_PW_gc = (0x06<<5) ; Pulse-width Capture

; Event Selection
.equ TC_EVSEL_OFF_gc = (0x00<<0) ; No Event Source
.equ TC_EVSEL_CH0_gc = (0x08<<0) ; Event Channel 0
.equ TC_EVSEL_CH1_gc = (0x09<<0) ; Event Channel 1
.equ TC_EVSEL_CH2_gc = (0x0A<<0) ; Event Channel 2
.equ TC_EVSEL_CH3_gc = (0x0B<<0) ; Event Channel 3

; Error Interrupt Level
.equ TC_ERRINTLVL_OFF_gc = (0x00<<2) ; Interrupt Disabled
.equ TC_ERRINTLVL_LO_gc = (0x01<<2) ; Low Level
.equ TC_ERRINTLVL_MED_gc = (0x02<<2) ; Medium Level
.equ TC_ERRINTLVL_HI_gc = (0x03<<2) ; High Level

; Overflow Interrupt Level
.equ TC_OVFINTLVL_OFF_gc = (0x00<<0) ; Interrupt Disabled
.equ TC_OVFINTLVL_LO_gc = (0x01<<0) ; Low Level
.equ TC_OVFINTLVL_MED_gc = (0x02<<0) ; Medium Level
.equ TC_OVFINTLVL_HI_gc = (0x03<<0) ; High Level

; Compare or Capture D Interrupt Level
.equ TC_CCDINTLVL_OFF_gc = (0x00<<6) ; Interrupt Disabled
.equ TC_CCDINTLVL_LO_gc = (0x01<<6) ; Low Level
.equ TC_CCDINTLVL_MED_gc = (0x02<<6) ; Medium Level
.equ TC_CCDINTLVL_HI_gc = (0x03<<6) ; High Level

; Compare or Capture C Interrupt Level
.equ TC_CCCINTLVL_OFF_gc = (0x00<<4) ; Interrupt Disabled
.equ TC_CCCINTLVL_LO_gc = (0x01<<4) ; Low Level
.equ TC_CCCINTLVL_MED_gc = (0x02<<4) ; Medium Level
.equ TC_CCCINTLVL_HI_gc = (0x03<<4) ; High Level

; Compare or Capture B Interrupt Level
.equ TC_CCBINTLVL_OFF_gc = (0x00<<2) ; Interrupt Disabled
.equ TC_CCBINTLVL_LO_gc = (0x01<<2) ; Low Level
.equ TC_CCBINTLVL_MED_gc = (0x02<<2) ; Medium Level
.equ TC_CCBINTLVL_HI_gc = (0x03<<2) ; High Level

; Compare or Capture A Interrupt Level
.equ TC_CCAINTLVL_OFF_gc = (0x00<<0) ; Interrupt Disabled
.equ TC_CCAINTLVL_LO_gc = (0x01<<0) ; Low Level
.equ TC_CCAINTLVL_MED_gc = (0x02<<0) ; Medium Level
.equ TC_CCAINTLVL_HI_gc = (0x03<<0) ; High Level

; Timer/Counter Command
.equ TC_CMD_NONE_gc = (0x00<<2) ; No Command
.equ TC_CMD_UPDATE_gc = (0x01<<2) ; Force Update
.equ TC_CMD_RESTART_gc = (0x02<<2) ; Force Restart
.equ TC_CMD_RESET_gc = (0x03<<2) ; Force Hard Reset

; High Byte Underflow Interrupt Level
.equ TCSPLIT_HUNFINTLVL_OFF_gc = (0x00<<2) ; Interrupt Disabled
.equ TCSPLIT_HUNFINTLVL_LO_gc = (0x01<<2) ; Low Level
.equ TCSPLIT_HUNFINTLVL_MED_gc = (0x02<<2) ; Medium Level
.equ TCSPLIT_HUNFINTLVL_HI_gc = (0x03<<2) ; High Level

; Low Byte Underflow Interrupt Level
.equ TCSPLIT_LUNFINTLVL_OFF_gc = (0x00<<0) ; Interrupt Disabled
.equ TCSPLIT_LUNFINTLVL_LO_gc = (0x01<<0) ; Low Level
.equ TCSPLIT_LUNFINTLVL_MED_gc = (0x02<<0) ; Medium Level
.equ TCSPLIT_LUNFINTLVL_HI_gc = (0x03<<0) ; High Level

; Low Byte Compare D Interrupt Level
.equ TCSPLIT_LCMPDINTLVL_OFF_gc = (0x00<<6) ; Interrupt Disabled
.equ TCSPLIT_LCMPDINTLVL_LO_gc = (0x01<<6) ; Low Level
.equ TCSPLIT_LCMPDINTLVL_MED_gc = (0x02<<6) ; Medium Level
.equ TCSPLIT_LCMPDINTLVL_HI_gc = (0x03<<6) ; High Level

; Low Byte Compare C Interrupt Level
.equ TCSPLIT_LCMPCINTLVL_OFF_gc = (0x00<<4) ; Interrupt Disabled
.equ TCSPLIT_LCMPCINTLVL_LO_gc = (0x01<<4) ; Low Level
.equ TCSPLIT_LCMPCINTLVL_MED_gc = (0x02<<4) ; Medium Level
.equ TCSPLIT_LCMPCINTLVL_HI_gc = (0x03<<4) ; High Level

; Low Byte Compare B Interrupt Level
.equ TCSPLIT_LCMPBINTLVL_OFF_gc = (0x00<<2) ; Interrupt Disabled
.equ TCSPLIT_LCMPBINTLVL_LO_gc = (0x01<<2) ; Low Level
.equ TCSPLIT_LCMPBINTLVL_MED_gc = (0x02<<2) ; Medium Level
.equ TCSPLIT_LCMPBINTLVL_HI_gc = (0x03<<2) ; High Level

; Low Byte Compare A Interrupt Level
.equ TCSPLIT_LCMPAINTLVL_OFF_gc = (0x00<<0) ; Interrupt Disabled
.equ TCSPLIT_LCMPAINTLVL_LO_gc = (0x01<<0) ; Low Level
.equ TCSPLIT_LCMPAINTLVL_MED_gc = (0x02<<0) ; Medium Level
.equ TCSPLIT_LCMPAINTLVL_HI_gc = (0x03<<0) ; High Level

; Timer/Counter Command
.equ TCSPLIT_CMD_NONE_gc = (0x00<<2) ; No Command
.equ TCSPLIT_CMD_RESTART_gc = (0x02<<2) ; Force Restart
.equ TCSPLIT_CMD_RESET_gc = (0x03<<2) ; Force Hard Reset

; Timer/Counter Command
.equ TCSPLIT_CMDEN_LOW_gc = (0x01<<0) ; Low Byte Timer/Counter
.equ TCSPLIT_CMDEN_HIGH_gc = (0x02<<0) ; High Byte Timer/Counter
.equ TCSPLIT_CMDEN_BOTH_gc = (0x03<<0) ; Both Low Byte and High Byte Timer/Counters


;***************************************************************************
;** AWEX - Timer/Counter Advanced Waveform Extension
;***************************************************************************/

; AWEX_CTRL masks
.equ AWEX_PGM_bm = 0x20 ; Pattern Generation Mode bit mask
.equ AWEX_PGM_bp = 5 ; Pattern Generation Mode bit position
.equ AWEX_CWCM_bm = 0x10 ; Common Waveform Channel Mode bit mask
.equ AWEX_CWCM_bp = 4 ; Common Waveform Channel Mode bit position
.equ AWEX_DTICCDEN_bm = 0x08 ; Dead Time Insertion Compare Channel D Enable bit mask
.equ AWEX_DTICCDEN_bp = 3 ; Dead Time Insertion Compare Channel D Enable bit position
.equ AWEX_DTICCCEN_bm = 0x04 ; Dead Time Insertion Compare Channel C Enable bit mask
.equ AWEX_DTICCCEN_bp = 2 ; Dead Time Insertion Compare Channel C Enable bit position
.equ AWEX_DTICCBEN_bm = 0x02 ; Dead Time Insertion Compare Channel B Enable bit mask
.equ AWEX_DTICCBEN_bp = 1 ; Dead Time Insertion Compare Channel B Enable bit position
.equ AWEX_DTICCAEN_bm = 0x01 ; Dead Time Insertion Compare Channel A Enable bit mask
.equ AWEX_DTICCAEN_bp = 0 ; Dead Time Insertion Compare Channel A Enable bit position

; AWEX_FDCTRL masks
.equ AWEX_FDDBD_bm = 0x10 ; Fault Detect on Disable Break Disable bit mask
.equ AWEX_FDDBD_bp = 4 ; Fault Detect on Disable Break Disable bit position
.equ AWEX_FDMODE_bm = 0x04 ; Fault Detect Mode bit mask
.equ AWEX_FDMODE_bp = 2 ; Fault Detect Mode bit position
.equ AWEX_FDACT_gm = 0x03 ; Fault Detect Action group mask
.equ AWEX_FDACT_gp = 0 ; Fault Detect Action group position
.equ AWEX_FDACT0_bm = (1<<0) ; Fault Detect Action bit 0 mask
.equ AWEX_FDACT0_bp = 0 ; Fault Detect Action bit 0 position
.equ AWEX_FDACT1_bm = (1<<1) ; Fault Detect Action bit 1 mask
.equ AWEX_FDACT1_bp = 1 ; Fault Detect Action bit 1 position

; AWEX_STATUS masks
.equ AWEX_FDF_bm = 0x04 ; Fault Detect Flag bit mask
.equ AWEX_FDF_bp = 2 ; Fault Detect Flag bit position
.equ AWEX_DTHSBUFV_bm = 0x02 ; Dead Time High Side Buffer Valid bit mask
.equ AWEX_DTHSBUFV_bp = 1 ; Dead Time High Side Buffer Valid bit position
.equ AWEX_DTLSBUFV_bm = 0x01 ; Dead Time Low Side Buffer Valid bit mask
.equ AWEX_DTLSBUFV_bp = 0 ; Dead Time Low Side Buffer Valid bit position

; AWEX_STATUSSET masks
; Masks for FDF aready defined
; Masks for DTHSBUFV aready defined
; Masks for DTLSBUFV aready defined
 
